[
  {
    "key": "FinOps",
    "href": "/glossary/finops",
    "description": "FinOps is the practice of bringing financial accountability to variable spending. It enables teams to understand and control costs and scale efficiently.",
    "sections": [
      {
        "title": "Introduction",
        "paragraphs": [
          "In today's rapidly shifting cloud landscape, managing costs can be a complex task. Traditional financial models may struggle to keep up with the dynamic nature of cloud spending, leading to unexpected costs and inefficiencies. Enter FinOps, a practice designed to bring agility to the financial aspect of cloud management."
        ]
      },
      {
        "title": "What is FinOps?",
        "paragraphs": [
          "FinOps stands for Financial Operations and is a cultural practice that aims to create a balance between speed, cost, and quality within an organization's cloud environment. By fostering collaboration between IT, finance, and business teams, FinOps ensures that every dollar spent in the cloud translates into business value."
        ]
      },
      {
        "title": "The Three Phases of FinOps",
        "paragraphs": [
          "Inform: The first phase is about creating visibility and understanding where and how money is spent in the cloud. This includes setting up proper tracking, tagging, and monitoring.",
          "Optimize: Once there's clear visibility, the next step is to identify areas for improvement and optimization. This could involve rightsizing resources, identifying waste, or renegotiating contracts.",
          "Operate: The final phase involves continuously monitoring and controlling costs, ensuring that spending aligns with business goals and that there's ongoing collaboration between all involved parties."
        ]
      },
      {
        "title": "Why FinOps Matters",
        "paragraphs": [
          "FinOps is more than just a cost-saving measure; it's a strategic approach to cloud financial management. By creating transparency and fostering collaboration, organizations can make more informed decisions, aligning their cloud investments with business objectives.",
          "The practice of FinOps promotes a shared understanding and responsibility for cloud costs across the organization. No longer are financial considerations the sole domain of the finance department; every team member becomes a stakeholder in the financial health of the organization's cloud operations."
        ]
      },
      {
        "title": "Conclusion",
        "paragraphs": [
          "FinOps represents a fundamental shift in the way organizations approach cloud financial management. By embracing this practice, organizations can navigate the complex landscape of cloud economics, turning what was once a daunting challenge into a strategic asset.",
          "In the end, FinOps is about empowerment, efficiency, and alignment, transforming the way organizations understand and control their cloud costs, and, in turn, ensuring that investments in the cloud are strategic, deliberate, and value-driven."
        ]
      }
    ]
  },
  {
    "key": "Cloud Computing",
    "href": null,
    "description": "Cloud computing refers to the delivery of computing services over the Internet. It provides on-demand access to a variety of resources and applications."
  },
  {
    "key": "Anomaly (cost anomalies)",
    "href": null,
    "description": "Anomalies in costs refer to unexpected spikes or drops. These could indicate a potential issue or inefficiency in the system."
  },
  {
    "key": "IaC",
    "href": null,
    "description": "Infrastructure as Code (IaC) is the process of managing and provisioning computing infrastructure through machine-readable definition files."
  },
  {
    "key": "Pulumi",
    "href": null,
    "description": "Pulumi is an open-source infrastructure as code tool that allows developers to use familiar programming languages to manage cloud resources."
  },
  {
    "key": "Terraform",
    "href": null,
    "description": "Terraform is an open-source infrastructure as code software tool. It enables building, changing, and versioning infrastructure efficiently."
  },
  {
    "key": "Hashicorp",
    "href": null,
    "description": "HashiCorp provides open-source tools and commercial products that enable developers, operators, and security professionals to provision, secure, and run distributed application infrastructures."
  },
  {
    "key": "CI/CD",
    "href": null,
    "description": "Continuous Integration and Continuous Deployment (CI/CD) automate the testing and deployment of applications, enhancing the development process."
  },
  {
    "key": "TCO (Total Cost of Ownership)",
    "href": null,
    "description": "Total Cost of Ownership (TCO) includes the purchase price of an asset plus operating costs over the asset's lifespan. It's a critical financial estimate."
  },
  {
    "key": "Showback",
    "href": null,
    "description": "Showback refers to the process of tracking and demonstrating IT service costs without charging the business units. It helps in cost transparency."
  },
  {
    "key": "Chargeback",
    "href": null,
    "description": "Chargeback is a method of charging business units for IT services rendered. It aids in creating accountability and encourages responsible usage."
  },
  {
    "key": "EDP (Enterprise Discount Program)",
    "href": null,
    "description": "Enterprise Discount Program (EDP) offers volume-based discounts for large businesses. It encourages loyalty and streamlines purchasing."
  },
  {
    "key": "EA (Enterprise Agreement)",
    "href": null,
    "description": "An Enterprise Agreement (EA) is a licensing agreement that offers large organizations the ability to standardize their IT procurement process."
  },
  {
    "key": "Commitment Usage Discount (CUD)",
    "href": null,
    "description": "Commitment Usage Discount refers to a price reduction based on a customer's commitment to a certain level of usage over time."
  },
  {
    "key": "Cost and Usage Report (CUR)",
    "href": null,
    "description": "Cost and Usage Report (CUR) provides detailed information about costs and usage. It's a vital tool for monitoring and optimizing expenses."
  },
  {
    "key": "Amortized costs",
    "href": null,
    "description": "Amortized costs represent the gradual reduction of a debt over a specific period. In cloud computing, it refers to the spread of costs over time."
  },
  {
    "key": "Cloud Center of Excellence (CCoE)",
    "href": null,
    "description": "A Cloud Center of Excellence (CCoE) is a dedicated team that drives cloud adoption and best practices within an organization."
  },
  {
    "key": "Cloud Service Provider (CSP)",
    "href": null,
    "description": "A Cloud Service Provider (CSP) is a company that offers a range of computing services and resources over the Internet."
  },
  {
    "key": "AWS",
    "href": null,
    "description": "Amazon Web Services (AWS) is a leading cloud services platform. It offers computing power, database storage, and content delivery."
  },
  {
    "key": "GCP",
    "href": null,
    "description": "Google Cloud Platform (GCP) is a suite of cloud computing services. It provides infrastructure, platform services, and networking capabilities."
  },
  {
    "key": "Azure",
    "href": null,
    "description": "Microsoft Azure is a set of cloud services that help organizations meet business challenges. It's a flexible, scalable computing platform."
  },
  {
    "key": "Tags (metadata)",
    "href": null,
    "description": "Tags are metadata that can be added to resources for identification, organization, and management. They're commonly used in cloud environments."
  },
  {
    "key": "VSCode extension",
    "href": null,
    "description": "A VSCode extension enhances the functionality of Visual Studio Code. They can range from themes and debuggers to tools for specific languages."
  },
  {
    "key": "Platform engineering",
    "href": null,
    "description": "Platform engineering involves creating a shared set of tools, services, and libraries that other engineering teams consume to increase efficiency."
  },
  {
    "key": "Spotify Backstage",
    "href": null,
    "description": "Spotify Backstage is an open platform for building developer portals. It aims to unify all your infrastructure tooling, services, and documentation."
  }
]
